{
  "id": "sitesnap",
  "name": "SiteSnap",
  "description": "Job site photo auto-organizer for solo contractors. AI-powered classification, before/after comparison generator, $5/mo. Product #3 in trades micro SaaS portfolio. First CAMERA-pipeline product.",
  "status": "in-progress",
  "tasks": [
    {
      "agent": "thomas",
      "role": "Product Manager",
      "task": "Write SiteSnap requirements",
      "status": "completed",
      "subtasks": [
        "Read and reviewed SiteSnap scoping doc (draft) for completeness",
        "Cross-referenced VoiceNote Pro requirements for shared infrastructure patterns",
        "Reviewed trades roadmap for SiteSnap's position as CAMERA pipeline foundation",
        "Wrote 11 user stories with full acceptance criteria and interaction states checklists",
        "Defined the CAMERA pipeline (R2 + Sharp + Gemini multimodal) as new infrastructure distinct from VoiceNote Pro",
        "Specified the photo upload flow: client compress -> presigned URL -> direct R2 upload -> backend classification",
        "Differentiated free tier gating model (10 active jobs, persistent) from VoiceNote Pro (10 notes/month, consumable)",
        "Cataloged shared components from VoiceNote Pro vs. new components needed",
        "Defined 14 PostHog events for product analytics",
        "Set pipeline order: Andrei+Kai -> Robert+Jonah+Howard+Priya (parallel) -> Zara -> Robert review -> Enzo+Nadia -> Yuki",
        "Documented 8 key architectural decisions with rationale"
      ],
      "filesChanged": [
        "docs/sitesnap-requirements.md",
        "data/pipeline-log/sitesnap.json",
        "data/pipeline-log/index.json"
      ],
      "decisions": [
        "Gemini multimodal over Roboflow for general photo classification -- cheaper, more flexible, no custom training needed. Roboflow reserved for specialized detection in later products.",
        "Direct-to-R2 upload via presigned URLs -- photos bypass the Express server to avoid bandwidth bottlenecks",
        "10-job persistent free tier (with archive escape valve) instead of consumable monthly limit -- creates natural upgrade moment at ~2 months",
        "iOS-first with Android fast-follow -- contractors skew iPhone, QA budget focused on one platform for v1",
        "Server-side classification only -- no on-device AI, keeps app lightweight, allows prompt iteration without app updates",
        "SiteSnap watermark on all comparisons on all tiers -- viral loop, not a premium feature",
        "No PDF reports in v1 -- before/after comparison image is the MVP of 'show your work'",
        "Zara handles mobile solo for v1 (no Leo) -- scope is manageable for one mobile developer"
      ]
    },
    {
      "agent": "andrei",
      "role": "Technical Architect",
      "task": "Write SiteSnap tech approach",
      "status": "completed",
      "subtasks": [
        "Read and analyzed Thomas's SiteSnap requirements (11 user stories, camera pipeline spec, data model, API endpoints)",
        "Cross-referenced VoiceNote Pro tech approach to identify reusable infrastructure vs. new camera-specific components",
        "Reviewed trades roadmap for camera product grouping (SiteSnap, CrackReport, WeldGrade, HardHatCheck) and reuse strategy",
        "Reviewed Marco's tech research on Gemini multimodal vs Roboflow for photo classification decisions",
        "Decided on separate camera-products monorepo (ADR-001) -- voice and camera products share infra boilerplate but no product-specific code",
        "Designed full photo capture pipeline: client compress (expo-image-manipulator) -> presigned URL -> direct R2 upload -> server thumbnail (Sharp) + async Gemini classification",
        "Designed R2 bucket architecture with user-scoped keys, 5-min upload URLs, 1-hour download URLs, and URL refresh strategy",
        "Designed upload retry queue with exponential backoff (3 retries) and AsyncStorage persistence across app restarts",
        "Defined Gemini multimodal classification integration: async fire-and-forget, 0.6 confidence threshold, short polling for results",
        "Designed Sharp-based comparison image compositor (1080x1080, labels, header, watermark, R2 caching)",
        "Made ADR-006: Zustand + AsyncStorage instead of local SQLite -- SiteSnap doesn't need local-first since photos require network",
        "Defined complete Drizzle ORM schema with indexes optimized for job list, photo timeline, and cross-job search",
        "Documented full API contract (18 endpoints) with auth, rate limiting, and free tier enforcement",
        "Wrote 11-day build plan with parallel tracks (BE+Design+Payments -> Mobile -> Review -> QA)",
        "Created reusable shared packages: @sitesnap/camera, @sitesnap/r2-client, @sitesnap/shared, @sitesnap/api-client"
      ],
      "filesChanged": [
        "docs/sitesnap-tech-approach.md",
        "data/pipeline-log/sitesnap.json",
        "data/work-items/sitesnap.json"
      ],
      "decisions": [
        "ADR-001: Separate camera-products monorepo -- voice and camera products share no product-specific code; separate repos keep workspaces focused",
        "ADR-002: Client-side compression (2048px, JPEG 80%) before upload -- cellular connections at job sites demand small uploads",
        "ADR-003: Single R2 bucket with user-scoped keys -- simpler than per-user buckets, presigned URLs control access",
        "ADR-004: Sharp on Express server (no separate service) -- fast enough for v1 volume, clean service boundary for later extraction",
        "ADR-005: Async classification, photo always saves first -- classification failure never causes data loss",
        "ADR-006: Zustand + AsyncStorage, no local SQLite -- photos require network, local-first is unnecessary overhead, expo-image cache handles offline viewing",
        "Sequential upload queue (not parallel) -- more reliable on weak cellular connections",
        "Short polling for classification status (not WebSocket) -- simpler infrastructure, classification takes 1-3 seconds",
        "Conservative 0.6 confidence threshold -- rather show 'unclassified' than wrong classification; tune via PostHog reclassification events",
        "expo-image for thumbnail caching -- built-in disk cache, blurhash placeholders, no custom cache layer needed",
        "R2 comparison image caching -- keyed by hash(beforeId + afterId), avoids regeneration on re-share"
      ]
    },
    {
      "agent": "kai",
      "role": "AI Engineer",
      "task": "Design Gemini multimodal classification prompt",
      "status": "completed",
      "subtasks": [
        "Reviewed Thomas's requirements (Section 9 AI integration) and Andrei's tech approach (Section 6 Gemini classification)",
        "Cross-referenced VoiceNote Pro AI patterns for established Gemini integration patterns and team conventions",
        "Refined Thomas's starter classification prompt with explicit confidence bands, ambiguous photo handling, and non-job-site photo detection",
        "Designed Gemini structured output schema with enum constraints for type and trade fields, eliminating post-processing normalization",
        "Made deliberate decision to exclude 'unclassified' from the Gemini enum -- it is application logic, not model output",
        "Wrote production-ready classifyPhoto() function with 10s timeout, AbortController, confidence clamping, and comprehensive error handling",
        "Verified Thomas's cost estimate ($0.0002/photo) against current Gemini 2.0 Flash pricing and image tokenization rules",
        "Identified Gemini 2.0 Flash retirement date (March 31, 2026) and documented migration path to gemini-2.5-flash-lite",
        "Designed 22-case test matrix covering 12 happy-path scenarios (6 types x 2 trades each) and 10 edge cases (selfies, paperwork, dark photos)",
        "Wrote test runner script for manual classification accuracy validation with fixture photos",
        "Defined PostHog-based accuracy monitoring strategy using photo_reclassified events to measure prompt quality over time",
        "Documented extension patterns for CrackReport, WeldGrade, and HardHatCheck AI integrations"
      ],
      "filesChanged": [
        "docs/sitesnap-ai-patterns.md",
        "data/pipeline-log/sitesnap.json"
      ],
      "decisions": [
        "Temperature 0.2 (not 0.1 like VoiceNote Pro) -- visual classification has more inherent ambiguity than text extraction; slightly higher temp lets the model express uncertainty through its confidence range",
        "No few-shot examples for image classification -- unlike text-to-text tasks, textual descriptions of hypothetical images do not improve visual classification accuracy. The schema enforces format.",
        "Exclude 'unclassified' from Gemini enum -- forces the model to always make its best guess with a confidence score. Our code applies the 0.6 threshold. This gives us richer signal than letting the model opt out.",
        "Do NOT send user's profile trade to Gemini -- would bias classification. A plumber photographing an electrical issue should get trade: 'electrical', not 'plumbing'. Trade is detected from visual evidence only.",
        "Model name as env var (GEMINI_MODEL_NAME) -- Gemini 2.0 Flash retires March 31, 2026. Config change vs. code change for migration.",
        "Use @google/generative-ai (older SDK) for consistency with VoiceNote Pro pattern and Andrei's tech approach. Note newer @google/genai SDK exists for future standardization.",
        "Explicit confidence bands in prompt (0.85-1.0, 0.6-0.84, 0.3-0.59, 0.0-0.29) -- LLMs default to high confidence without explicit permission to express uncertainty"
      ]
    },
    {
      "agent": "robert",
      "role": "Product Designer",
      "task": "Write SiteSnap design spec",
      "status": "completed",
      "subtasks": [
        "Read and analyzed Thomas's requirements (11 user stories, camera pipeline, free tier gating, comparison generator, all interaction states)",
        "Read Andrei's tech approach (monorepo structure, Expo Router file layout, component names, R2 presigned URL lifecycle, Zustand store shape)",
        "Read Kai's AI patterns doc for classification confidence thresholds and type taxonomy affecting badge design",
        "Cross-referenced VoiceNote Pro design spec for established dark-mode mobile patterns, typography scale, and spacing conventions",
        "Incorporated CEO decisions: Apple IAP payments ($4.99 price point), sitesnap-photos R2 bucket, Gemini 3.0 Flash Preview model",
        "Defined complete dark-mode color system: blue-gray accent (#4F8EF7) instead of orange to differentiate from VoiceNote Pro, 8 photo type badge colors verified for colorblind accessibility",
        "Verified all color contrast ratios against WCAG AA/AAA for text-on-background pairs including all 6 type badge colors on dark card backgrounds",
        "Designed 10 screens with full interaction state coverage: Home (job list), Job Creation Modal, Camera FAB + capture flow, Job Detail / Photo Timeline, Before/After Comparison Generator, Search, Profile/Settings, Upgrade Prompt, Auth (Clerk), Full-Screen Photo Viewer",
        "Specified every component with implementation-ready values: CameraFAB (64px, upload badge), JobCard (swipe-to-archive), PhotoThumbnail (3-column grid, shimmer loading), TypeBadge (8 type colors), TypeFilterChips (multi-select, counts), ComparisonPreview (share/save), UpgradeSheet (Apple IAP flow), JobSelector (bottom sheet)",
        "Designed complete empty/zero states for all data-dependent views: no jobs (first launch), no photos in job, no search results, no archived jobs, filter with no matches",
        "Designed loading states for every async operation: skeleton job cards, shimmer photo grid, upload-in-progress thumbnails with pending badges, comparison generation spinner, auth setup interstitial",
        "Designed error states with retry paths: job list load failure, photo load failure, job creation failure (server + network), comparison generation failure, upload failure with retry indicator",
        "Specified camera capture flow with no preview step (speed over review) -- shutter button, flash animation, gallery picker, camera permission denied state",
        "Specified comparison selection mode: numbered overlays, instruction banner, disabled-to-enabled generate button, and the 1080x1080 output image layout (labels, header, footer, watermark)",
        "Defined 18 micro-interaction animations with durations and easings, plus reduced-motion fallbacks for all",
        "Specified accessibility requirements: 44px touch targets, screen reader labels for all interactive elements, motion sensitivity handling, color-plus-text for all status indicators"
      ],
      "filesChanged": [
        "docs/sitesnap-design-spec.md",
        "data/pipeline-log/sitesnap.json",
        "data/work-items/sitesnap.json"
      ],
      "decisions": [
        "Blue-gray accent (#4F8EF7) over construction orange -- differentiates from VoiceNote Pro's orange identity, avoids competing with real safety gear in photos, reads as 'precision instrument' and pairs better with the 6 colorful type badges",
        "Dark-mode only -- outdoor legibility (less glare), makes photos pop against dark chrome, matches VoiceNote Pro precedent, ships faster with one mode to test",
        "3-column photo grid -- sweet spot between scanability (~115px thumbnails are large enough to identify content) and density (enough visible to feel like a timeline). 2 columns wastes space, 4 columns too small for sunlight.",
        "No camera preview step after shutter -- speed is paramount for the job site use case. Photo goes directly to upload queue. Bad photos are deleted from the timeline (easy). Keeps the camera path at one-tap-open, one-tap-shoot.",
        "2-tab navigation + Camera FAB (not 3+ tabs) -- minimal cognitive load. Home and Profile are the only persistent destinations. Search is contextual from header. Camera FAB is the only globally-accessible action.",
        "Portrait lock, no landscape -- one-handed job site use. Halves testing surface. No user scenario justifies landscape for a phone-based photo organizer.",
        "Type badges as colored pills on thumbnails (not hidden in detail view) -- type must be visible at grid level for the timeline to be scannable. Each badge uses both color AND text label for colorblind accessibility.",
        "Bottom sheet pattern for Job Creation and Job Selector (not full-screen modals) -- feels lighter, faster, more native. User can see the app behind the sheet. Consistent with iOS conventions.",
        "'Maybe Later' + archive tip on upgrade prompt -- intentionally not pushy. Gives a genuine free alternative. Builds trust. Contractors who feel pressured churn; contractors who feel respected upgrade when ready.",
        "Server-generated comparison image (not client-side composition) -- consistent high-quality 1080x1080 output, cached in R2 for re-sharing without regeneration. The 1-3 second wait is acceptable for a 'create marketing content' flow.",
        "Abbreviated badge labels (PROG., MATER., MEAS.) to fit on small thumbnails -- full names would overflow or require smaller text below 11px minimum",
        "$4.99 Apple IAP price point (not $5.00) -- Apple rounds to standard price tiers. $4.99 is the nearest tier to the $5/month specification."
      ]
    },
    {
      "agent": "jonah",
      "role": "Backend Developer",
      "task": "Build SiteSnap Express API (jobs, photos, R2, Gemini, comparison)",
      "status": "completed",
      "subtasks": [
        "Set up Express server project at sitesnap-server/ with package.json, tsconfig.json, drizzle.config.ts, .env.example",
        "Installed all production dependencies (@aws-sdk/client-s3, @clerk/express, @google/generative-ai, drizzle-orm, express, sharp, stripe, zod) and dev dependencies",
        "Created Drizzle ORM schema for 5 tables: users, jobs, photos, subscriptions, processed_events with proper indexes for query performance",
        "Built R2 service (services/r2.ts) with presigned URL generation (5-min upload, 1-hour download), object download/upload/delete, prefix-based bulk delete for job cleanup, and key builder helpers",
        "Implemented Gemini classification service (services/gemini.ts) using Kai's production prompt with structured JSON output, configurable model via GEMINI_MODEL_NAME env var (default: gemini-3.0-flash-preview), 10s timeout via Promise.race, 0.6 confidence threshold, and comprehensive error handling that always returns unclassified on failure",
        "Built Sharp image processing service (services/sharp.ts) with 400px thumbnail generation and 1080x1080 comparison image compositor including BEFORE/AFTER labels, job name header, business name footer, and Made with SiteSnap watermark using SVG overlays",
        "Created Loops email service (services/loops.ts) for contact creation, transactional email, and event-triggered sequences",
        "Built Clerk webhook handler (webhooks/clerk.ts) with Svix signature verification, idempotent processing via processedEvents table, user record creation, and fire-and-forget Loops contact creation",
        "Built Stripe webhook handler (webhooks/stripe.ts) with signature verification, idempotency, and handlers for checkout.session.completed, invoice.paid, invoice.payment_failed, customer.subscription.updated, customer.subscription.deleted with proper user plan upgrades/downgrades",
        "Created auth middleware (middleware/auth.ts) with Clerk JWT verification and DB user resolution that attaches dbUser to the request for downstream routes",
        "Created rate limiting middleware (middleware/rate-limit.ts) with 3 limiters: 100 photos/day, 20 comparisons/hour, 3 checkouts/minute -- all keyed by Clerk userId",
        "Built user profile routes (routes/user.ts): GET /api/me returns profile + subscription status + active job count; PUT /api/me updates businessName and trade with Zod validation",
        "Built job CRUD routes (routes/jobs.ts): paginated listing with cursor-based pagination and status filter, create with server-side free tier enforcement (402 when at limit), get/update/delete with ownership verification, hard delete with cascade + R2 cleanup",
        "Built photo routes (routes/photos.ts): paginated photo listing with presigned download URLs, presigned upload URL generation, upload confirmation with fire-and-forget background processing pipeline (R2 download -> Sharp thumbnail -> Gemini classification -> DB updates), manual type override, photo deletion with R2 cleanup, URL refresh endpoint",
        "Built cross-job search route (routes/search.ts) with job name substring search, type filter, date range filter, cursor-based pagination, and presigned download URL generation for results",
        "Built comparison image generation route (routes/compare.ts) with R2 cache check, source photo download, Sharp composition, R2 cache storage, and JPEG response with proper Content-Type header",
        "Built billing routes (routes/billing.ts): Stripe Checkout session creation with customer get-or-create, Apple IAP placeholder (501 for now), subscription status endpoint",
        "Created Express entry point (index.ts) with proper middleware ordering: health check -> raw body webhooks -> CORS -> JSON parser -> Clerk middleware -> API routes -> 404 handler -> error handler, with startup env var validation",
        "Verified all code compiles cleanly with tsc --noEmit (zero type errors)"
      ],
      "filesChanged": [
        "sitesnap-server/package.json",
        "sitesnap-server/tsconfig.json",
        "sitesnap-server/drizzle.config.ts",
        "sitesnap-server/.env.example",
        "sitesnap-server/src/index.ts",
        "sitesnap-server/src/db/index.ts",
        "sitesnap-server/src/db/schema/users.ts",
        "sitesnap-server/src/db/schema/jobs.ts",
        "sitesnap-server/src/db/schema/photos.ts",
        "sitesnap-server/src/db/schema/subscriptions.ts",
        "sitesnap-server/src/db/schema/events.ts",
        "sitesnap-server/src/routes/index.ts",
        "sitesnap-server/src/routes/user.ts",
        "sitesnap-server/src/routes/jobs.ts",
        "sitesnap-server/src/routes/photos.ts",
        "sitesnap-server/src/routes/search.ts",
        "sitesnap-server/src/routes/compare.ts",
        "sitesnap-server/src/routes/billing.ts",
        "sitesnap-server/src/webhooks/clerk.ts",
        "sitesnap-server/src/webhooks/stripe.ts",
        "sitesnap-server/src/middleware/auth.ts",
        "sitesnap-server/src/middleware/rate-limit.ts",
        "sitesnap-server/src/services/r2.ts",
        "sitesnap-server/src/services/gemini.ts",
        "sitesnap-server/src/services/sharp.ts",
        "sitesnap-server/src/services/loops.ts",
        "data/work-items/sitesnap.json",
        "data/pipeline-log/sitesnap.json"
      ],
      "decisions": [
        "Used Gemini 3.0 Flash Preview as the default model per CEO decision, configurable via GEMINI_MODEL_NAME env var for easy migration",
        "R2 bucket name set to sitesnap-photos per CEO decision, configurable via R2_BUCKET_NAME env var",
        "Kept both Stripe and Apple IAP paths in billing routes: Stripe Checkout for web/Android, Apple IAP placeholder (501) for iOS until IAP is fully configured",
        "Used Promise.race for Gemini timeout instead of AbortController signal -- more compatible across @google/generative-ai versions",
        "Background photo processing is fire-and-forget from the API response to keep upload confirmation under 500ms. Failure fallback always sets type to unclassified.",
        "Used cursor-based pagination instead of offset-based for all list endpoints -- more performant and stable when data changes between page requests",
        "Webhook handlers verify signatures before any processing and use the processedEvents table for idempotency to handle Clerk and Stripe replay safely",
        "Comparison images cached in R2 with deterministic keys (SHA-256 of both photo IDs) to avoid regeneration on re-share. Cache miss triggers generation.",
        "Job deletion uses cascade delete on photos FK for DB cleanup and fire-and-forget prefix-based R2 deletion for storage cleanup",
        "Server placed at sitesnap-server/ inside TeamHQ temporarily -- will be moved to its own repo when the monorepo is created"
      ]
    },
    {
      "agent": "howard",
      "role": "Payments Engineer",
      "task": "Apple IAP payment architecture and server-side integration spec",
      "status": "completed",
      "subtasks": [
        "Read Thomas's requirements (free tier gating, Stripe Managed Payments references), Andrei's tech approach (Section 10 payments, subscription schema), and Kai's AI patterns doc",
        "Read VoiceNote Pro payments spec to understand existing Stripe Checkout pattern and identify what changes for Apple IAP",
        "Read Clerk-Stripe integration skill doc for shared webhook patterns and middleware ordering conventions",
        "Designed complete Apple IAP architecture replacing Stripe Managed Payments -- Apple handles payment collection, our backend tracks subscription state via receipt validation and S2S notifications",
        "Specified App Store Connect product configuration: auto-renewable subscription, $4.99/month, product ID, subscription group, grace period and billing retry settings",
        "Designed receipt validation flow using App Store Server API v2 with @apple/app-store-server-library -- JWS verification, product ID validation, idempotent upsert on originalTransactionId",
        "Wrote complete Apple S2S V2 webhook handler covering 10 notification types: SUBSCRIBED, DID_RENEW, DID_FAIL_TO_RENEW, DID_CHANGE_RENEWAL_STATUS, EXPIRED, GRACE_PERIOD_EXPIRED, REFUND, REVOKE, CONSUMPTION_REQUEST",
        "Designed subscription state machine with 7 states (active, will_cancel, billing_retry_period, grace_period_expired, expired, refunded, revoked) and documented access rules for each state",
        "Wrote resolveSubscription and enforceJobLimit middleware for free tier enforcement on POST /api/jobs",
        "Designed GET /api/billing/status endpoint with server-side expiration catch-up for missed webhooks",
        "Documented updated subscription schema diverging from Andrei's Stripe-based schema: originalTransactionId replaces stripeSubscriptionId, added productId and environment fields, expanded status enum",
        "Wrote complete client-side integration guide for Zara: react-native-iap setup, purchase flow, restore purchases flow, pending receipt retry, UpgradeSheet component data requirements",
        "Documented 7 edge cases with handling strategies: IAP success + backend failure, grace period, device switch, restore on reinstall, sandbox testing, family sharing, price increase",
        "Calculated revenue impact: $3.49/month net at 30% Apple cut vs $4.81/month with Stripe-only -- CEO accepted the tradeoff for frictionless UX",
        "Wrote 17-scenario test plan covering happy path, cancellation, renewal, billing failure, restore, idempotency, and refund",
        "Documented coordination notes for Jonah (schema changes, removed Stripe webhook), Zara (react-native-iap, finishTransaction requirement), and Andrei (env var changes, middleware ordering)"
      ],
      "filesChanged": [
        "docs/sitesnap-payments-spec.md",
        "data/pipeline-log/sitesnap.json",
        "data/work-items/sitesnap.json"
      ],
      "decisions": [
        "Apple IAP over Stripe Checkout (CEO decision) -- frictionless purchase flow (Face ID + one tap), no App Store rejection risk, Apple handles tax/fraud/disputes. Trade-off: 30% platform fee vs 3.5% Stripe fee.",
        "Use @apple/app-store-server-library (Apple's official Node.js SDK) -- handles JWS verification, root CA cert chain, and S2S notification decoding. No manual crypto.",
        "react-native-iap over expo-in-app-purchases -- better StoreKit 2 support, more actively maintained, handles both iOS and Android (for future Google Play billing).",
        "originalTransactionId as the canonical subscription key -- stable across all renewals of the same subscription, unlike transaction IDs which change on every renewal.",
        "7-state subscription state machine (vs Andrei's original 3-state Stripe model) -- Apple has more granular lifecycle events. billing_retry_period and will_cancel states let us keep users subscribed during grace periods and pre-cancellation windows.",
        "Always call finishTransaction() even if backend verification fails -- Apple refunds unfinished transactions after ~3 days. Store receipt locally for retry instead.",
        "Auto-restore on Clerk sign-in -- prevents users who switch devices from needing to manually find the Restore Purchases button. Zero-friction device migration.",
        "Removed Stripe env vars (STRIPE_SECRET_KEY, STRIPE_WEBHOOK_SECRET, STRIPE_PRICE_MONTHLY) for v1 -- Apple IAP is the sole payment path. Stripe comes back if we add web/Android billing later.",
        "Server-side expiration catch-up in GET /api/billing/status -- if a subscription period has passed and we missed the EXPIRED webhook, the status endpoint detects and corrects it. Belt and suspenders."
      ]
    },
    {
      "agent": "priya",
      "role": "Product Marketer",
      "task": "App Store copy, Facebook group pitch",
      "status": "completed",
      "subtasks": [
        "Read and analyzed Thomas's SiteSnap requirements (Sections 1-3: product summary, target user, scope) and all 11 user stories",
        "Read VoiceNote Pro messaging doc to establish consistent format and calibrate tone for trades audience",
        "Read Sherlock Labs brand voice guidelines and adapted them for contractor-facing copy",
        "Defined audience (solo contractors, iPhone, Facebook-active, price-sensitive) and one key message (your job photos file themselves)",
        "Wrote one-liner pitch with three contextual variants (general, dispute angle, Facebook before/after angle)",
        "Wrote full App Store listing: name, subtitle (30 chars), promotional text (170 chars), description (4000 chars), keywords (100 chars), What's New",
        "Wrote Facebook trade group post designed to feel organic, not like an ad -- includes posting strategy notes for the team",
        "Wrote before/after share caption defaults (short, proud, contractor voice) with alternates",
        "Wrote upgrade prompt copy (headline, subhead, value bullets, CTA, dismiss text) with rationale for the dismiss text teaching the archive escape valve",
        "Wrote welcome email copy for Loops integration (subject, preview text, body with three first-steps)",
        "Wrote subscription confirmation email copy",
        "Created SiteSnap-specific voice and tone reference with word choices table and sentence rules",
        "Wrote competitive positioning against CompanyCam, Camera Roll, and Google/Apple Photos with one-liner differentiators",
        "Wrote six App Store screenshot captions"
      ],
      "filesChanged": [
        "docs/sitesnap-messaging.md",
        "data/pipeline-log/sitesnap.json",
        "data/work-items/sitesnap.json"
      ],
      "decisions": [
        "Kept the name SiteSnap -- two syllables, self-explanatory (site + snap), easy to say on a job site. No alternatives needed.",
        "Led the App Store description with the dispute story ($400 lost) rather than a feature list -- pain before solution. Contractors have all felt this.",
        "Subtitle 'Job Photos, Filed Automatically' over alternatives like 'Auto-Organize Job Photos' -- passive voice ('filed') makes it feel like the app does the work, not the user.",
        "Facebook post written in first person as a contractor, not as SiteSnap the company. No link in the initial post -- let comments drive engagement. Feels authentic, not like an ad.",
        "Upgrade prompt dismiss text says 'Not now -- I'll archive a job' instead of just 'Not now' -- teaches the free escape valve, keeps users in the product, reduces churn at the paywall.",
        "Before/after share captions kept extremely short (4-5 words). Contractors don't write paragraphs on Facebook. The photo does the talking.",
        "Deliberately avoided all tech language in user-facing copy. 'It sorts your photos' not 'AI-powered classification.' The user doesn't care how it works.",
        "Positioned against CompanyCam by price and audience, not features. 'CompanyCam is for crews. SiteSnap is for you.' Don't compete on feature parity -- compete on fit."
      ]
    },
    {
      "agent": "zara",
      "role": "Mobile Developer",
      "task": "Build SiteSnap Expo app",
      "status": "completed",
      "subtasks": [
        "Set up Expo project scaffolding: package.json with all dependencies, tsconfig.json (strict mode), app.config.ts (dark mode, portrait lock, camera/photo permissions, IAP), eas.json (dev/preview/production profiles)",
        "Built complete design token system (lib/tokens.ts) matching Robert's spec: 13 core color tokens, 8 photo type badge color pairs, 12 spacing tokens, 7 typography levels, 5 radii tokens, 6 shadow presets including FAB glow",
        "Built typed API client (lib/api.ts) with Clerk JWT injection via setTokenProvider(), ApiError class, and all 18+ endpoint functions matching Jonah's backend API contract including direct-to-R2 upload via presigned URLs",
        "Built Zustand store (lib/store.ts) with AsyncStorage persistence: active job tracking, upload queue management (add/update/remove/clear), user plan cache, and pending receipts for IAP retry",
        "Built Apple IAP integration (lib/iap.ts) using react-native-iap: StoreKit 2 connection, subscription product fetch, Promise-based purchase flow wrapping listener pattern per Howard's Section 12, restore purchases, and pending receipt retry",
        "Built upload queue manager (lib/upload.ts): client-side compression (expo-image-manipulator, 2048px max, JPEG 80%), sequential upload pipeline (presigned URL -> R2 upload -> confirm), exponential backoff retry (5s/15s/45s, max 3)",
        "Built 12 reusable components: TypeBadge (color-coded classification), TypeFilterChips (horizontal scroll, multi-select), CameraFAB (64px circle, haptic feedback, upload badge), JobCard (active dot, metadata row, press state), PhotoThumbnail (3-column grid calc, expo-image disk cache, shimmer/retry/selection states), JobSelector (bottom sheet), JobCreationSheet (form with validation, keyboard avoiding), TypePicker (manual reclassification bottom sheet), UpgradeSheet (full-screen modal with value props and IAP flow), ComparisonPreview (image with share/save buttons), EmptyState (reusable icon/heading/subtext/CTA), SkeletonLoader (shimmer animation for cards and grids), Toast (slide-down notification with auto-dismiss)",
        "Built global toast notification system (lib/toast-context.tsx) with React context provider",
        "Built root layout (app/_layout.tsx) with provider chain: GestureHandlerRootView -> SafeAreaProvider -> ClerkProvider -> QueryClientProvider -> PostHogProvider -> AuthBridge -> IAPBridge -> ToastProvider",
        "Built auth flow: sign-in and sign-up screens with email/password and Google OAuth via @clerk/clerk-expo, proper keyboard handling, error states",
        "Built tab bar layout (app/(app)/_layout.tsx) with 2 tabs (Home/Profile) + CameraFAB overlay, job selector and creation sheets, hidden tab screens for Job Detail/Search/Compare/Upgrade",
        "Built Home screen with job list (FlatList, pull-to-refresh, skeleton loading, empty state, archived jobs collapsible section, free tier indicator, new job button with upgrade gate)",
        "Built Job Detail screen with photo timeline (SectionList grouped by date, 3-column grid, type filter chips, compare selection mode with numbered overlays, overflow menu with ActionSheetIOS, manual type reclassification via TypePicker)",
        "Built Search screen with debounced text input, type filter chips, results grouped by job name, recent photos default view, no-results state",
        "Built Compare screen with server-generated image preview, share (expo-sharing) and save (expo-media-library) actions, loading and error states with retry",
        "Built Profile screen with editable business name (inline text input), trade picker (ActionSheetIOS), subscription status with upgrade link, sign out with confirmation alert"
      ],
      "filesChanged": [
        "sitesnap-app/package.json",
        "sitesnap-app/tsconfig.json",
        "sitesnap-app/app.config.ts",
        "sitesnap-app/eas.json",
        "sitesnap-app/lib/tokens.ts",
        "sitesnap-app/lib/types.ts",
        "sitesnap-app/lib/constants.ts",
        "sitesnap-app/lib/api.ts",
        "sitesnap-app/lib/store.ts",
        "sitesnap-app/lib/iap.ts",
        "sitesnap-app/lib/upload.ts",
        "sitesnap-app/lib/utils.ts",
        "sitesnap-app/lib/toast-context.tsx",
        "sitesnap-app/components/TypeBadge.tsx",
        "sitesnap-app/components/TypeFilterChips.tsx",
        "sitesnap-app/components/CameraFAB.tsx",
        "sitesnap-app/components/JobCard.tsx",
        "sitesnap-app/components/PhotoThumbnail.tsx",
        "sitesnap-app/components/JobSelector.tsx",
        "sitesnap-app/components/JobCreationSheet.tsx",
        "sitesnap-app/components/TypePicker.tsx",
        "sitesnap-app/components/UpgradeSheet.tsx",
        "sitesnap-app/components/ComparisonPreview.tsx",
        "sitesnap-app/components/EmptyState.tsx",
        "sitesnap-app/components/SkeletonLoader.tsx",
        "sitesnap-app/components/Toast.tsx",
        "sitesnap-app/app/_layout.tsx",
        "sitesnap-app/app/index.tsx",
        "sitesnap-app/app/(auth)/_layout.tsx",
        "sitesnap-app/app/(auth)/sign-in.tsx",
        "sitesnap-app/app/(auth)/sign-up.tsx",
        "sitesnap-app/app/(app)/_layout.tsx",
        "sitesnap-app/app/(app)/home/index.tsx",
        "sitesnap-app/app/(app)/jobs/[id].tsx",
        "sitesnap-app/app/(app)/search.tsx",
        "sitesnap-app/app/(app)/compare.tsx",
        "sitesnap-app/app/(app)/profile.tsx",
        "sitesnap-app/app/(app)/upgrade.tsx",
        "data/work-items/sitesnap.json",
        "data/pipeline-log/sitesnap.json"
      ],
      "decisions": [
        "Used Expo managed workflow as specified -- no ejection needed. All required native features (camera, image picker, media library, haptics, secure store) available via Expo SDK modules.",
        "Expo Router file-based routing matching the navigation structure from Robert's design spec exactly: (auth) group for sign-in/sign-up, (app) group for tabs + hidden screens",
        "Tab bar uses Expo Router Tabs component with 2 visible tabs (Home/Profile) and 4 hidden screens (jobs/[id], search, compare, upgrade) accessible via navigation only",
        "Camera FAB positioned as an absolute overlay inside the (app) layout, not as a tab -- matches design spec requirement for the FAB to be visible on all screens within the app",
        "Used Zustand + AsyncStorage per Andrei's ADR-006 -- no local SQLite. Upload queue persists across app restarts via the store middleware.",
        "react-native-iap for Apple IAP per Howard's recommendation over expo-in-app-purchases -- better StoreKit 2 support, handles the purchase listener pattern that the payments spec requires",
        "Sequential upload processing (one-at-a-time) per Andrei's ADR -- more reliable on cellular connections at job sites. Upload queue manager uses a processing lock to prevent concurrent uploads.",
        "Photo thumbnails calculated dynamically from screen width: (screenWidth - 32px padding - 8px gaps) / 3 -- matches the 3-column grid spec",
        "Used React.memo on all reusable components per the mobile performance guidelines -- prevents unnecessary re-renders in lists",
        "Toast notification system implemented as a React context provider rather than a global singleton -- cleaner integration with the component tree and supports proper lifecycle management",
        "Used SectionList for the photo timeline on Job Detail to support date-grouped headers with the 3-column grid -- each section renders its photos as a wrapped flex row",
        "ActionSheetIOS used for the overflow menu and trade picker on iOS per design spec -- native platform feel over custom bottom sheets for these interactions",
        "Comparison flow uses expo-sharing for native share sheet and expo-media-library for camera roll save -- standard Expo modules, no additional native dependencies needed",
        "Clerk token provider set up in a dedicated AuthBridge component inside the root layout -- ensures the API client always has access to the current JWT without prop drilling"
      ]
    },
    {
      "agent": "robert",
      "role": "Product Designer",
      "task": "Design review against implementation",
      "status": "completed",
      "subtasks": [
        "Read and analyzed all 13 components in sitesnap-app/components/ against design spec Sections 5.1-5.8",
        "Verified all design tokens in lib/tokens.ts: 13 core colors, 8 type badge color pairs, 12 spacing values, 7 typography levels, 5 radii, 6 shadow presets -- all exact matches to spec",
        "Checked 7 screen files against spec Sections 4.1-4.8: Home, Job Detail, Search, Compare, Profile, Upgrade, Tab Layout",
        "Verified tab bar layout: 2 tabs (Home/Me) + CameraFAB overlay, 84px height, correct active/inactive colors, FAB 64px with shadow and haptic",
        "Checked all empty states (no jobs, no photos, no search results, filter empty) -- copy and icons match spec",
        "Checked all loading states (skeleton cards, skeleton grid, shimmer animation, comparison spinner) -- present and correctly structured",
        "Checked all error states (job list, photo list, comparison, job creation server + network) -- present with retry paths",
        "Verified accessibility: accessibilityRole, accessibilityLabel, and accessibilityState present on all interactive elements",
        "Identified 14 deviations ranging from font weight mismatches to missing gesture handlers",
        "Classified all issues as Note (can ship) -- no blocking issues found",
        "Wrote design review report to docs/sitesnap-design-review.md with severity, location, expected/actual for each issue",
        "Prioritized 7 polish fixes for post-QA pass ordered by user impact"
      ],
      "filesChanged": [
        "docs/sitesnap-design-review.md",
        "data/work-items/sitesnap.json",
        "data/pipeline-log/sitesnap.json"
      ],
      "decisions": [
        "Pass with notes -- no blocking issues. All deviations are minor (font weight, touch target padding, missing animations, absent date range picker) and can be addressed in a polish pass after QA.",
        "Accepted centered header title on Job Detail as a valid iOS convention even though spec implies left-alignment -- both work, centered is consistent with Zara's pattern across all push screens.",
        "Accepted absence of Profile icon in Home header -- redundant with tab bar, and removing it reduces visual clutter. Logged as a note for Thomas to confirm.",
        "Logged swipe-to-archive and date range picker as post-QA enhancements rather than QA blockers -- core functionality is accessible through other paths."
      ]
    },
    {
      "agent": "atlas",
      "role": "Code Reviewer",
      "task": "Backend code review of sitesnap-server/src/",
      "status": "completed",
      "subtasks": [
        "Read Andrei's tech approach (docs/sitesnap-tech-approach.md) to understand intended architecture and API contract",
        "Read Howard's payments spec (docs/sitesnap-payments-spec.md) to understand Apple IAP requirements vs implemented Stripe path",
        "Reviewed all 22 TypeScript source files in sitesnap-server/src/ including entry point, DB schema (5 tables), routes (7 files), webhooks (2), middleware (2), and services (4)",
        "Reviewed package.json dependencies for necessity and safety",
        "Verified Clerk webhook signature verification using Svix library -- correctly implemented with raw body parsing and idempotency",
        "Verified Stripe webhook signature verification -- correctly implemented with constructEvent and idempotency",
        "Checked all endpoints for Clerk auth requirement -- all protected except webhooks and health check, correct",
        "Checked user ownership enforcement on all data-access routes -- consistent WHERE user_id checks on jobs, photos, search, compare, billing",
        "Verified R2 presigned URL scoping -- upload URLs scoped to correct key, 5-min expiry, download URLs 1-hour expiry, matching spec",
        "Verified Gemini classification fallback to unclassified on any failure -- correctly implemented with 10s timeout",
        "Verified photo delete cleans up both R2 original and thumbnail -- correctly implemented with fire-and-forget",
        "Checked database indexes match tech approach spec -- all 5 specified indexes present",
        "Identified 3 Critical issues: SQL wildcard injection in search, payments architecture mismatch (Stripe implemented vs Apple IAP specified), comparison image proxied through Express instead of presigned URL",
        "Identified 6 Major issues: no background task concurrency control, photoCount drift potential, unstable cursor pagination on tied timestamps, r2Key not validated against expected pattern, billing status missing expiry check, job deletion order risk",
        "Identified 5 Minor issues: sequential R2 deletes (should batch), in-memory rate limiter resets on deploy, env var validation after listen, comparison cache not invalidated on photo delete, (1 intentional/no-action)",
        "Noted 7 positive patterns: Gemini fallback handling, consistent ownership checks, webhook idempotency, Zod input validation, SVG XML escaping, clean route-service-DB separation"
      ],
      "filesChanged": [
        "docs/sitesnap-code-review.md"
      ],
      "decisions": [
        "C-1 BLOCKER: Search route needs wildcard character escaping in ilike() to prevent DoS via crafted % patterns",
        "C-2 BLOCKER: Payments path must be resolved -- Jonah built Stripe Checkout, Howard spec'd Apple IAP. Thomas must confirm which path ships in v1.",
        "C-3 BLOCKER: Comparison endpoint should return presigned URL, not proxy JPEG through Express -- violates Andrei's core architecture principle",
        "M-6: r2Key in upload confirmation should be validated against expected pattern to prevent storing arbitrary R2 paths in the DB",
        "M-5: Billing status endpoint needs subscription expiry check as Howard specified -- safety net against missed webhooks",
        "M-1: Background photo processing needs concurrency control (p-limit or similar) to prevent OOM under burst uploads",
        "M-3: Cursor pagination should use composite (takenAt, id) cursor for stable results when timestamps collide",
        "Accepted in-memory rate limiter for v1 with documented upgrade path to Redis store",
        "Accepted orphaned R2 objects after job deletion as acceptable v1 trade-off given R2 storage costs ($0.015/GB)",
        "Accepted photoCount drift risk for v1 with recommendation for periodic reconciliation"
      ]
    },
    {
      "agent": "jonah",
      "role": "Backend Developer",
      "task": "Fix 3 critical and 3 major issues from Atlas code review",
      "status": "completed",
      "subtasks": [
        "C-1: Fixed SQL wildcard injection in search.ts -- added escapeLikePattern() utility that escapes %, _, and \\ before wrapping in %..% for ilike()",
        "C-2: Replaced entire Stripe Checkout billing path with Apple IAP per Howard's payments spec -- rewrote billing.ts with POST /api/billing/verify-receipt (JWS verification via @apple/app-store-server-library) and enriched GET /api/billing/status with server-side expiry check",
        "C-2: Rewrote subscriptions schema -- replaced stripeSubscriptionId with originalTransactionId (unique), added productId and environment fields, expanded to 7-state subscription model",
        "C-2: Created webhooks/apple.ts with complete S2S V2 notification handler covering 10 notification types (SUBSCRIBED, DID_RENEW, DID_FAIL_TO_RENEW, DID_CHANGE_RENEWAL_STATUS, EXPIRED, GRACE_PERIOD_EXPIRED, REFUND, REVOKE, CONSUMPTION_REQUEST) with JWS verification and idempotency",
        "C-2: Created middleware/subscription.ts with resolveSubscription (enriches request with effective plan) and enforceJobLimit (402 at 10-job limit for free users) per Howard's Section 7",
        "C-2: Deleted webhooks/stripe.ts, removed stripe dependency from package.json, replaced Stripe env vars with Apple IAP vars in .env.example",
        "C-2: Updated index.ts -- replaced Stripe webhook route with Apple webhook, moved env var validation before app.listen(), updated optional env var list",
        "C-3: Rewrote compare.ts to return JSON { comparisonUrl, comparisonId } with presigned R2 download URL instead of proxying JPEG binary through Express",
        "C-3: Added objectExists() function to r2.ts using HeadObjectCommand for lightweight R2 cache checks without downloading",
        "M-1: Added p-limit dependency and backgroundProcessingLimit = pLimit(3) to photos.ts, wrapping fire-and-forget background processing",
        "M-3: Fixed cursor pagination in photos.ts and search.ts to use composite (takenAt, id) comparison via sql template literal, added desc(photos.id) as secondary sort",
        "M-5: Server-side expiry check implemented in billing.ts status endpoint -- checks currentPeriodEnd against current time, downgrades if expired even without webhook"
      ],
      "filesChanged": [
        "sitesnap-server/src/routes/search.ts",
        "sitesnap-server/src/routes/billing.ts",
        "sitesnap-server/src/routes/compare.ts",
        "sitesnap-server/src/routes/photos.ts",
        "sitesnap-server/src/services/r2.ts",
        "sitesnap-server/src/db/schema/subscriptions.ts",
        "sitesnap-server/src/db/schema/events.ts",
        "sitesnap-server/src/webhooks/apple.ts",
        "sitesnap-server/src/webhooks/stripe.ts (deleted)",
        "sitesnap-server/src/middleware/subscription.ts",
        "sitesnap-server/src/index.ts",
        "sitesnap-server/package.json",
        "sitesnap-server/.env.example",
        "data/pipeline-log/sitesnap.json"
      ],
      "decisions": [
        "Used @apple/app-store-server-library SignedDataVerifier for JWS verification -- Apple's official SDK handles cert chain validation and environment switching automatically",
        "Subscription schema uses originalTransactionId as canonical key per Howard's spec -- stable across all renewals of the same subscription",
        "7-state subscription model (active, will_cancel, billing_retry_period, grace_period_expired, expired, refunded, revoked) -- matches Apple's lifecycle granularity and Howard's state machine",
        "Compare endpoint returns JSON with presigned URL instead of binary JPEG -- client downloads directly from R2, Express server stays thin per Andrei's architecture",
        "HEAD request (objectExists) for R2 cache check instead of GET -- avoids downloading the full image just to check existence",
        "p-limit concurrency of 3 for background photo processing -- prevents OOM under burst uploads while still allowing reasonable parallelism",
        "Composite cursor (takenAt, id) for pagination -- guarantees stable page boundaries when photos share the same timestamp",
        "Merged M-5 fix into C-2 implementation -- server-side expiry check is a natural part of the billing status rewrite"
      ]
    },
    {
      "agent": "enzo",
      "role": "QA Engineer",
      "task": "Full QA pass — release gate",
      "status": "completed",
      "subtasks": [
        "Read all 7 project docs: requirements, design spec, tech approach, payments spec, design review, code review, AI patterns",
        "Read all 22+ backend source files in sitesnap-server/src/ (routes, middleware, services, webhooks, DB schemas, entry point)",
        "Read all 25+ mobile app files in sitesnap-app/ (screens, components, lib modules, layout files)",
        "Verified Atlas C-1 fix: escapeLikePattern() in search.ts correctly escapes SQL wildcards (%, _, \\) before ilike()",
        "Verified Atlas C-2 fix: Full Apple IAP implementation replaces Stripe -- SignedDataVerifier, 7-state subscription model, S2S V2 webhook handler with 10 notification types, server-side expiry check",
        "Verified Atlas C-3 fix: compare.ts returns JSON {comparisonUrl, comparisonId} with presigned R2 download URL; objectExists() uses HEAD request for cache check",
        "Verified all 11 user stories' acceptance criteria against code implementation (US-1 through US-11)",
        "Verified all 17 Apple IAP test scenarios from Howard's payments spec Section 18 at code level",
        "Conducted security review: auth enforcement, ownership checks, webhook verification, input validation, rate limiting, R2 key scoping, SQL injection prevention",
        "Identified B-1 (potentially blocking): comparison API response format mismatch -- server returns JSON but client calls res.blob()",
        "Identified N-6 (potentially high impact): API response shape mismatch -- server returns {jobs:[]} but client expects {data:[]}",
        "Identified 6 additional non-blocking issues: missing full-screen photo viewer, camera FAB navigation, single-type search filter, missing date picker, missing swipe-to-archive, missing PostHog events",
        "Wrote comprehensive QA report with pass/fail verdicts per user story, blocking issues, non-blocking issues, risk assessment, and device testing requirements",
        "Created 3 new work items (SS-12 through SS-14) for follow-up fixes and device testing"
      ],
      "filesChanged": [
        "docs/sitesnap-qa-report.md",
        "data/work-items/sitesnap.json",
        "data/pipeline-log/sitesnap.json"
      ],
      "decisions": [
        "CONDITIONAL PASS verdict -- backend code is production-ready, mobile app architecture is sound, but two potential integration issues (B-1, N-6) need device verification before App Store submission",
        "Cannot issue a full PASS without device testing -- this is a React Native mobile app that requires Xcode and an iOS simulator or physical device to test interactively",
        "B-1 (comparison format mismatch) is the highest-priority fix -- the comparison generator is described as 'the killer feature' and 'the viral loop'. If confirmed broken, it is a quick fix in api.ts but must be done before launch.",
        "N-6 (API response shape) could mean empty job list and photo timeline -- potentially high impact but also a quick fix if confirmed",
        "All non-blocking issues (N-1 through N-8) are acceptable for v1 launch per the product philosophy of shipping fast and iterating"
      ]
    },
    {
      "agent": "nadia",
      "role": "Technical Writer",
      "task": "App Store description, FAQ, privacy policy",
      "status": "completed",
      "subtasks": [
        "Read Thomas's requirements (11 user stories, free tier gating, pricing, target user, scope), Priya's messaging (App Store copy, voice/tone guide, word choices), and Howard's payments spec (Apple IAP at $4.99, subscription states, cancellation flow)",
        "Noted price discrepancy: requirements say $5/month, Howard's payments spec says $4.99 (Apple IAP tier). Used $4.99 throughout all docs to match the actual Apple IAP configuration.",
        "Wrote App Store listing (docs/sitesnap-app-store.md): app name, subtitle (30 chars), promotional text (167 chars), full description, keywords (99 chars), What's New for v1.0.0, 6 screenshot captions, support/privacy URL placeholders, App Store Connect metadata (categories, age rating, IAP details)",
        "Wrote FAQ (docs/sitesnap-faq.md): 10 questions a contractor would actually ask, covering photo organization, offline behavior, pricing, free tier, cancellation, sharing, Android availability, search, privacy, and manual reclassification. All answers 2-3 sentences in contractor language.",
        "Wrote privacy policy (docs/sitesnap-privacy-policy.md): plain-English policy covering account data, photo storage (R2, encrypted, private), AI classification (Gemini, not retained by Google), 7 third-party services with data access table, EXIF stripping on shares, data retention and deletion, what we don't collect, children's privacy",
        "Cross-referenced all three documents for terminology consistency: used Priya's word choices table (photos not media, job not project, sorts not classifies, etc.) in FAQ and privacy policy",
        "Verified all pricing references match Apple IAP tier ($4.99/month) across all three documents",
        "Added legal counsel note to privacy policy -- it is a plain-English summary, not a substitute for legal review",
        "Updated SS-10 in data/work-items/sitesnap.json to completed with owner Nadia"
      ],
      "filesChanged": [
        "docs/sitesnap-app-store.md",
        "docs/sitesnap-faq.md",
        "docs/sitesnap-privacy-policy.md",
        "data/work-items/sitesnap.json",
        "data/pipeline-log/sitesnap.json"
      ],
      "decisions": [
        "Used $4.99 (Apple IAP price tier) throughout all docs instead of $5/month from original requirements -- Howard's payments spec confirmed the actual App Store price is $4.99 at Apple's Tier 2 pricing.",
        "Adopted Priya's App Store description verbatim rather than rewriting -- her copy was already formatted for App Store submission, battle-tested in the contractor voice, and approved as final. Added structural metadata (categories, age rating, IAP info) that Priya's messaging doc did not cover.",
        "Wrote privacy policy in plain English, not legalese -- contractors won't read a wall of legal text, and the product philosophy says 'document what someone needs, not everything that exists.' Added explicit note to consult legal counsel before publishing.",
        "Included a third-party services table in the privacy policy listing all 7 services with exactly what data each one sees -- transparency builds trust with a trade audience that is skeptical of apps wanting their data.",
        "Added the 'What if the app sorts a photo wrong?' FAQ entry -- this is a practical concern not covered by the other 9 questions, and the answer teaches the manual reclassification feature (long-press the type badge).",
        "Kept FAQ answers to 2-3 sentences maximum -- matches the product philosophy of concise docs that people actually read. Contractors decide fast; long answers lose them.",
        "Included App Store Connect metadata table in the listing doc (primary/secondary category, age rating, content rights, IAP declaration) -- Priya's messaging covered copy but not the submission metadata fields."
      ]
    },
    {
      "agent": "zara",
      "role": "Mobile Developer",
      "task": "Fix B-1 and N-6 from Enzo's QA report",
      "status": "completed",
      "subtasks": [
        "B-1: Rewrote generateComparison() in api.ts to parse JSON { comparisonUrl, comparisonId } instead of calling res.blob() -- the server now returns a presigned R2 URL, not binary JPEG",
        "B-1: Removed dead image/binary content-type handling from apiFetch() -- no endpoint returns binary anymore after the C-3 fix",
        "B-1: Rewrote compare.tsx to display the presigned URL directly via expo-image (instant display), then download to local cache via FileSystem.downloadAsync() for share/save operations",
        "B-1: Added localFileUri prop to ComparisonPreview component -- share/save buttons stay disabled until the local cache download completes, while the image displays immediately from the remote URL",
        "N-6: Replaced generic PaginatedResponse<T> type (which expected { data: T[] }) with three endpoint-specific types: PaginatedJobsResponse { jobs }, PaginatedPhotosResponse { photos }, PaginatedSearchResponse { photos } -- matching the actual server response shapes",
        "N-6: Fixed all 5 consuming locations: home/index.tsx (jobsData.jobs, archivedData.jobs), _layout.tsx (jobsData.jobs), jobs/[id].tsx (photosData.photos), search.tsx (searchData.photos, recentData.photos)",
        "N-6: Fixed unwrapped single-entity responses: getJob(), createJob(), updateJob() now unwrap { job: ... } wrapper; updatePhoto() now unwraps { photo: ... } wrapper -- these would have caused undefined access on .id, .name, etc.",
        "Verified no remaining references to old PaginatedResponse type or .data accessor pattern across the entire sitesnap-app codebase"
      ],
      "filesChanged": [
        "sitesnap-app/lib/api.ts",
        "sitesnap-app/lib/types.ts",
        "sitesnap-app/app/(app)/compare.tsx",
        "sitesnap-app/components/ComparisonPreview.tsx",
        "sitesnap-app/app/(app)/home/index.tsx",
        "sitesnap-app/app/(app)/jobs/[id].tsx",
        "sitesnap-app/app/(app)/search.tsx",
        "sitesnap-app/app/(app)/_layout.tsx",
        "data/pipeline-log/sitesnap.json"
      ],
      "decisions": [
        "Display comparison image via presigned URL directly (expo-image handles remote URLs natively) instead of downloading first then displaying -- faster perceived performance since the image renders as soon as the server responds, while the local cache download happens in the background for share/save",
        "Used FileSystem.downloadAsync() for the local cache download instead of the old blob-to-base64-to-writeAsStringAsync pipeline -- simpler, more efficient, and avoids the FileReader API which has reliability issues in React Native",
        "Replaced generic PaginatedResponse<T> with endpoint-specific types instead of making the server change its response format -- the server uses descriptive keys (jobs, photos) which is better API design, and changing the server would require re-testing all endpoints",
        "Also fixed single-entity response unwrapping (getJob, createJob, updateJob, updatePhoto) even though Enzo's N-6 only called out paginated responses -- same root cause, and leaving them broken would have caused undefined access errors on job creation, job detail view, and photo reclassification"
      ]
    },
    {
      "agent": "yuki",
      "role": "Data Analyst",
      "task": "Post-launch retrospective",
      "status": "pending",
      "subtasks": [],
      "filesChanged": [],
      "decisions": []
    }
  ]
}
